test-data/xml/scenario-07-limosa-extraction.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Scenario 7: Limosa Reference Extraction from Concatenated Field
     AI must extract "L-9876543210" from "Novak, Ivan - Limosa: L-9876543210"
     Must map to LimosaDeclaration node, NOT INSS node -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v1="http://socialsecurity.be/presenceregistration/v1"
                  xmlns:v11="http://socialsecurity.be/presenceregistration/schemas/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:RegisterPresencesRequest>
         <v1:PresenceRegistrationRequest>
            <v11:RegistrationDate>2026-03-16</v11:RegistrationDate>
            <v11:LimosaDeclaration>L-9876543210</v11:LimosaDeclaration>
            <v11:CompanyID>0412345678</v11:CompanyID>
            <v11:WorkPlaceId>W111222333</v11:WorkPlaceId>
         </v1:PresenceRegistrationRequest>
      </v1:RegisterPresencesRequest>
   </soapenv:Body>
</soapenv:Envelope>
